"use client";
import Accordion from "components/global/Accordion"

const questions = [
  {
    title:"ما هي مدة ضمان الأجهزة؟",
    content:"جميع أجهزتنا تحتوي على ضمان شامل لجميع الأعطال و المشاكل التقنية لمدة عامين من تاريخ الشراء."
  },
  {
    title:"هل أستطيع تجربة أي من الأجهزة؟",
    content:"بعد عملية الدفع، يحق للمشتري استرجاع كامل المبلغ خلال الشهر الأول في حال عدم الرضاء عن المنتج دون الحاجة للإجابة عن سؤال فيما يخص سبب الاسترجاع."
  },
  {
    title:"ما هي طريقة الاتصال بالأجهزة؟",
    content:"في كل جهاز من أجهزة هيدروجين هناك شريحة بيانات متصلة بأبراج الاتصالات. فبمجرد تحميل تطبيق الجوال و إضافة رقم الجهاز سيتمكن المستخدم من مراقبة المياه دون الحاجة لربط الجهاز بشبكة الواي فاي أو البلوتوث."
  },
  {
    title:"هل شركة هيدروجين موثوقة ؟",
    content:"نعم، شركة هيدروجين موثوقة ومسجلة في وزارة التجارة ، ومسجلة أيضا في معروف بالرقم التالي: 108013"
  },
]
export const Questions = () => {
  return (
    <div className="my-10 general-padding">
      <h2 className=" mb-4">الأسئلة الشائعة</h2>
      {
        questions.map((question, i) => (
          <Accordion
            key={ i }
            title={ question.title }
            content={ question.content }
          />
        ))
      }

    </div>
  );
}

